interface Privacy {
  key: number;
  summary: string;
  content: string;
}

const PRIVACY: Privacy[] = [
  {
    key: 1,
    summary: '개인정보 이용약관',
    content: ` 쩝쩝박사 서비스 이용약관은 bcsd lab에서 서비스를 제공함에 있어, 이용자간의 관리, 의무 및 책임 사항 등을 목적으로 합니다. 
    
    본 약관(이하 ‘본 약관’이라 함)은 쩝쩝박사 어플리케이션과 모바일 및 PC 포함 이와 관련된 웹사이트들(이하 ‘쩝쩝박사’라 함)을 통하여 제공되는 모든 제품 및 서비스(이하 ‘본 서비스’라 함)와 관련하여 본 약관에 따라 당사와 이용계약을 체결하고 본 서비스를 이용하는 고객(이하 ‘회원’이라 함)과 당사 간의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다. 당사에 회원가입을 하지 않고 단순 열람을 원하는 경우, 비회원 이용자를 위한 이용정책이 적용됩니다.`,
  },
  {
    key: 2,
    summary: '쩝쩝박사 이용약관',
    content: `쩝쩝박사는 관련법을 위배하지 않는 범위에서 본 약관의 내용을 수정할 수 있습니다. 본 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행 약관과 함께 쩝쩝박사의 관련 화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다. 다만, 회원에게 불리하게 약관내용을 변경하는 경우에는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다. 이 경우 당사는 개정 전 내용과 개정 후 내용을 명확하게 비교하여 회원이 알기 쉽도록 표시합니다. 회사가 개정약관을 공지 또는 통지하면서 회원에게 30일 기간 내에 의사표시를 하지 않으면 의사표시가 표명된 것으로 본다는 뜻을 명확하게 공지 또는 통지하였음에도 회원이 명시적으로 거부의 의사표시를 하지 아니한 경우 회원이 개정약관에 동의한 것으로 봅니다. 회원이 개정약관의 적용에 동의하지 않는 경우 회사는 개정 약관의 내용을 적용할 수 없으며, 이 경우 회원은 이용계약을 해지할 수 있습니다. 또한 기존 약관을 적용할 수 없는 특별한 사정이 있는 경우에는 회사는 회원에게 통지하고 이용계약을 해지할 수 있습니다. 본 약관이나 개정된 내용에 동의하지 않으면 서비스 이용을 중단해 주시기 바랍니다.


제1조 (약관 동의 및 자격 요건)

이용계약은 회원이 되고자 하는 자가 약관의 내용에 대하여 동의를 한 다음 회원가입 신청을 하고 당사가 이러한 신청에 대하여 승낙함으로써 체결됩니다. 당사는 이러한 신청에 대하여 이용을 승낙함을 원칙으로 합니다. 다만, 당사는 실명이 아니거나 타인의 명의를 이용한 경우, 허위의 정보를 기재하거나 당사가 제시하는 내용을 기재하지 않은 경우 등의 경우에 해당하는 신청에 대하여는 승낙을 하지 않거나 회원에게 통지하고 사후에 이용계약을 해지할 수 있습니다.

(1) 회원은 본 서비스 이용 시 본 약관의 규정된 내용을 따라야 하고 관련법규를 준수해야 합니다.

(2) 서비스 이용을 위하여 회원이 제공하는 모든 정보는 정확하고 사실이며 회원은 이 정보들의 정확성을 유지하도록 정보 변경 시 변경된 정보를 제공하여야 합니다.

(3) 회원은 최소 14세 이상이어야 하며 회원이 14세 미만이라고 확인되는 경우 회원 계정과 관련 정보는 별도의 통지 후 삭제될 수 있습니다.

 

제2조 (계정)

회원은 쩝쩝박사 어플리케이션을 이용하기 위하여 계정을 만들어야 합니다. 계정을 만들기 위해 제공되는 회원의 개인정보는 관련법과 당사의 개인보호 정책에 의하여 보호됩니다. 회원은 개인정보 변경 시 변경된 정보를 입력하여야 하며 계정의 보안과 기밀을 유지하기 위하여 노력합니다. 당사는 회원이 이용약관 또는 커뮤니티 가이드라인을 준수하지 않는다고 판단될 경우, 사전 통보 후 게시물을 삭제하거나 회원의 계정을 폐쇄 또는 접속을 제한할 수 있습니다. 단, 게시물의 경우 정보통신망법에 따라 삭제 또는 임시조치(블라인드) 후 통보할 수 있습니다.

 

제3조 (정보의 취급)

당사는 본 서비스 회원의 전화번호와 이메일주소 등의 정보를 수집합니다. 수집된 정보는 회원의 동의 없이는 다른 회원을 포함한 제3자에게는 절대 공개되지 않습니다. 구체적인 내용은 당사의 개인정보보호 정책을 통하여 확인하실 수 있습니다.

 

제4 조 (지적 재산권 및 서비스 내용물의 소유권 및 사용권)

(1) ‘내용물’ 이라 함은 문자, 그림, 사진, 동영상, 리뷰, 위치 및 기타 데이터 또는 모든 다른 형태의 송신 및 커뮤니케이션된 정보를 뜻합니다.  망고플레이트에 있는 모든 내용물(이하 ‘서비스 내용물’ 이라 함)은 관련 지적재산권의 보호를 받습니다. 회원은 당사의 서면 승인 없이 ‘망고플레이트 내용물’ 또는 ‘제3자 내용물’을 변경, 수집, 복제, 송신, 출판 (온라인, 오프라인 포함), 배포, 방송 기타 방법에 의하여 이용하거나 제3자에게 이용하게 하여서는 아니 됩니다.

(2) 서비스 내용물에는 회원 내용물, 쩝쩝박사 내용물과 제3자 내용물이 모두 포함됩니다.  ‘회원 내용물’ 이라 함은 평점, 리뷰, 사진, 북마크, 이벤트 참여, 혹은 닉네임 등 프로필에 기재하는 정보 등 회원이 쩝쩝박사를 이용하면서 등록하거나 그 외 당사 서버에 송신하는 모든 내용물을 의미합니다.  ‘쩝쩝박사 내용물’ 이라 함은 추천맛집, 기타 온라인 및 오프라인 제작물 등 쩝쩝박사가 직접 제작하는 내용물 혹은 당사 서버에 송신, 등록하는 모든 내용물을 의미합니다.  ‘제3자 내용물’ 이라 함은 ‘회원 내용물’ 혹은 ‘쩝쩝박사 내용물’은 아니지만 쩝쩝박사 서비스를 통해 회원에게 제공되는 내용물을 의미합니다.

(3) 쩝쩝박사 내용물에 대한 저작권 및 기타 지적 재산권은 당사에 귀속됩니다.  당사는 적절한 이유가 있을 경우 모든 서비스 내용물을 자의적으로 삭제, 수정, 편집, 복제 혹은 재등록할 수 있습니다. 본 계약에서 달리 명시된 바를 제외하고 당사는 회원에게 어떠한 라이선스나 사용권도 부여하지 않습니다. 본 약관은 당사 또는 당사로부터 라이선스를 받은 자가 서비스 내용물이나 서비스에 대해 가지고 있는 권리, 또 이와 연관된 특허, 상표, 저작권 또는 다른 지적재산권에 영향을 주지 않습니다. 본 약관은 쩝쩝박사의 상표나 다른 제3자의 상표권과 관련 라이선스나 다른 권리를 부여하지 않습니다.

(4) 회원(이하 ‘해당 회원’이라 함)이 직접 작성 및 등록한 평가점수, 게시물, 사진 등의 게시물(이하 ‘해당 회원 내용물’이라 함)에 대한 저작권 및 지적 재산권은 해당 회원에게 있으며, 해당 회원 내용물이 타인의 저작권을 침해하는 경우 그에 대한 책임은 해당 회원 본인이 부담합니다. 해당 회원은 당사에게 해당 회원 내용물을 독점적으로, 관련 법령이 허용하는 범위 내에서, 당사가 직접 또는 제3자와의 제휴를 통해 마케팅·홍보 등의 목적으로 일정 기간 이용할 수 있는 권리를 부여합니다. 당사는 해당 회원 내용물의 동일성을 해치지 않는 범위에서 적절히 수정, 편집 또는 가공할 수 있으며, 이러한 범위를 넘어서는 수정, 편집 또는 가공을 하기 위해서는 별도로 해당 회원의 동의를 구할 것입니다. 해당 회원은 해당 회원이 탈퇴 또는 휴면 상태인 경우에도 당사가 해당 회원 내용물을 상기와 동일한 조건으로 이용할 수 있는 권리가 있음에 동의합니다. 또한, 해당 회원은 당사가 커뮤니티 가이드라인 혹은 이용약관에 따라 언제든지 해당 회원 내용물을 삭제, 수정 혹은 재등록할 권한이 있음에 동의합니다. 단, 해당 회원은 해당 회원 내용물에 대하여 마케팅, 판촉, 홍보 및 기타 자료로 사용되지 않을 것을 요청할 수 있으며, 망고플레이트 서비스 내의 기능을 이용하여 해당 회원 내용물을 수정 혹은 삭제할 수 있습니다. 

(5) 제3자(해당 회원이 아닌 회원 포함)가 해당 회원 내용물에 대한 저작권 및 지적 재산권을 침범했을 가능성이 있는 적절한 판단 근거가 있을 경우, 해당 회원은 본인을 대리하여 해당 회원의 저작권 및 지적 재산권을 행사하고 적절한 법적 조치를 취할 권리를 독점적으로 당사에 위임합니다. 단, 해당 회원 본인이 저작권 및 지적 재산권을 직접 행사할 것을 당사에 요청할 수 있으나, 그와 같은 요청이 없을 경우 본 조항의 위임권에 동의한 것으로 간주합니다.

 

제 5 조 (게시물의 관리)  

(1) 회원의 게시물이 정보통신망법 및 저작권법등 관련법에 위반되는 내용을 포함하는 경우, 권리자는 관련법이 정한 절차에 따라 해당 게시물의 게시중단 및 삭제 등을 요청할 수 있으며, 당사는 관련법에 따라 조치를 취하여야 합니다.

(2) 회원은 다음 각 호에 해당하는 행위를 하여서는 안 됩니다. 당사는 전항에 따른 권리자의 요청이 없는 경우라도 다음 각 호에 해당된다고 판단되거나, 기타 당사 정책 및 관련법에 위반되는 경우에는 관련법에 따라 해당 게시물에 대해 임시조치, 삭제 등의 조치를 취할 수 있습니다.

1) 불법물, 외설, 음란물 등을 게시 또는 해당 내용과 관련된 사이트를 링크하는 경우
2) 욕설, 폭력적 내용 등을 게시하는 경우
3) 공공질서나 미풍양속에 위배되는 경우
4) 악의적인 목적으로 허위 또는 과장된 리뷰를 작성한 경우
5) 상업적, 홍보, 광고물을 게시하는 경우
6) 식당 운영자 및 관계자, 가족 및 친인척, 지인 등이 경쟁자 식당에 의도를 품은 리뷰를 남기는 경우
7) 종교, 성별, 인종 등을 차별하거나 인신공격적 내용을 포함한 경우
8) 다른 회원을 비방하거나 특정인의 개인정보를 거론하여 명예 훼손을 하는 경우
9) 다른 회원 혹은 제3자의 초상권, 저작권 등 기타 권리를 침해하는 경우
10) 구체적인 설명이나 근거 없이 비방만 하는 리뷰일 경우
11) 다른 회원의 리뷰나 사진을 복사하여 재게시한 경우
12) 해당 식당 음식의 맛 경험과 관련 없는 리뷰 및 사진을 게시한 경우
13) 의미 없는 문자 및 부호를 게시한 경우
14) 리뷰에 내용이 없이 링크만 게시하는 경우
15) 짧은 시간 내 연속적으로 체인점에 대한 리뷰가 올라오는 경우
16) 동일하거나 비슷한 내용의 리뷰를 반복적으로 게시하는 경우
17) 쩝쩝박사를 사칭하는 경우
18) 쩝쩝박사 회원에게 연락하여 리뷰 작성을 강요하거나 부탁하는 경우

(3) 본 조에 따른 세부절차는 정보통신망법 및 저작권법이 규정한 범위 내에서 회사가 정한 절차에 따릅니다.
 

제 6 조 (접근 및 간섭)

본 서비스를 이용함에 있어서, 회원은 다음에 동의합니다:

(1) 로봇, 스파이더, 스크래퍼, 크롤러 또는 기타 자동 장치를, 당사의 서면 허가 없이 어떠한 목적으로든지 쩝쩝박사 어플리케이션, PC 및 모바일 웹사이트 및 서비스 내용물에 접근하는데 사용되는 프로세스 및 수단을 사용하지 않기로 동의합니다.

(2) 쩝쩝박사의 기반 시설에 비합리적인 또는 비례에 맞지 않게 큰 부하를 가중시키거나 가중시킬 수 있는 (당사의 단독 재량 하에) 어떠한 조치도 취하지 않기로 동의합니다.

(3) 당사의 서면 동의 없이 당사가 제공하는 서비스 가운데 어떤 내용물을 감시하거나 복사하는 모든 매뉴얼 프로세스를 시행하지 않기로 동의합니다.

(4) 당사 서비스의 기능 및 내용물을 간섭하거나 간섭하려고 하는 모든 장치, 소프트웨어 또는 루틴을 활용하지 않기로 동의합니다.

 

제 7 조 (손해배상)

(1) 당사와 회원은 서비스 이용과 관련하여 고의 또는 과실로 상대방에게 손해를 끼친 경우에는 이를 배상하여야 합니다.

(2) 당사는 무료로 제공하는 서비스의 이용과 관련하여 개인정보보호정책에서 정하는 내용에 위반하지 않는 한 어떠한 손해도 책임을 지지 않습니다. 단, 당사의 고의 또는 중대한 과실이 있는 경우에는 그렇지 않습니다.

 

제 8 조 (면책조항)

(1) 당사는 천재지변, 전쟁, 기간통신사업자의 서비스 중지 및 기타 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 대한 책임이 면제됩니다.

(2) 당사는 서비스용 설비의 보수, 교체, 정기점검, 공사 등 부득이한 사유로 발생한 손해에 대한 책임이 면제됩니다.

(3) 당사는 회원의 컴퓨터 오류에 의해 손해가 발생한 경우, 또는 회원이 신상정보 및 전자우편 주소를 부실하게 기재하여 손해가 발생한 경우 책임을 지지 않습니다.

(4) 당사는 회원의 게시물을 등록 전에 사전심사 하거나 상시적으로 게시물의 내용을 확인 또는 검토하여야 할 의무가 없으며, 그 결과에 대한 책임을 지지 아니합니다.

 

제 9 조 (재판권 및 준거법)

(1) 이 약관에 명시되지 않은 사항은 전기통신사업법 등 대한민국의 관계법령과 상관습에 따릅니다.

(2) 당사의 유료 서비스를 이용하는 회원의 경우 해당 서비스와 관련하여서는 당사가 별도로 정한 약관 및 정책에 따릅니다.

(3) 서비스 이용으로 발생한 분쟁에 대해 소송이 제기되는 경우 소송의 관할은 민사소송법에 따라 정합니다.

 

부칙 (2022. 10. 08.)

본 약관은 앱 출시일부터 적용됩니다.`,
  },
];

export default PRIVACY;
